; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-8)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(free left)
(free right)
(at ball1 room3)
(at ball2 room4)
(at ball3 room4)
(at ball4 room5)
(at ball5 room5)
(at ball6 room5)
(at ball7 room6)
(at ball8 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
)
)
)

; plan
1. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 0 of 8
2. (pick ball8 room6 left)
   deleted: (at ball8 room6) (free left)
   added: (carry ball8 left)
   goals met: 0 of 8
3. (pick ball7 room6 right)
   deleted: (at ball7 room6) (free right)
   added: (carry ball7 right)
   goals met: 0 of 8
4. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 0 of 8
5. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 0 of 8
6. (drop ball7 rooma right)
   deleted: (carry ball7 right)
   added: (at ball7 rooma) (free right)
   goals met: 1 of 8
7. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 2 of 8
8. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 2 of 8
9. (pick ball6 room5 left)
   deleted: (at ball6 room5) (free left)
   added: (carry ball6 left)
   goals met: 2 of 8
10. (pick ball5 room5 right)
   deleted: (at ball5 room5) (free right)
   added: (carry ball5 right)
   goals met: 2 of 8
11. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 2 of 8
12. (drop ball5 rooma right)
   deleted: (carry ball5 right)
   added: (at ball5 rooma) (free right)
   goals met: 3 of 8
13. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 4 of 8
14. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 4 of 8
15. (pick ball4 room5 left)
   deleted: (at ball4 room5) (free left)
   added: (carry ball4 left)
   goals met: 4 of 8
16. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 4 of 8
17. (pick ball3 room4 right)
   deleted: (at ball3 room4) (free right)
   added: (carry ball3 right)
   goals met: 4 of 8
18. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 4 of 8
19. (drop ball3 rooma right)
   deleted: (carry ball3 right)
   added: (at ball3 rooma) (free right)
   goals met: 5 of 8
20. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 6 of 8
21. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 6 of 8
22. (pick ball2 room4 left)
   deleted: (at ball2 room4) (free left)
   added: (carry ball2 left)
   goals met: 6 of 8
23. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 6 of 8
24. (pick ball1 room3 right)
   deleted: (at ball1 room3) (free right)
   added: (carry ball1 right)
   goals met: 6 of 8
25. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 6 of 8
26. (drop ball2 rooma left)
   deleted: (carry ball2 left)
   added: (at ball2 rooma) (free left)
   goals met: 7 of 8
27. (drop ball1 rooma right)
   deleted: (carry ball1 right)
   added: (at ball1 rooma) (free right)
   goals met: 8 of 8
